Repository: no1coder/cubby
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# Recording paused: %@, skip likely secrets: %@, ignored apps: %lld
source: Recording paused: %1$@, skip likely secrets: %2$@, ignored apps: %3$lld
zh_hans: 暂停记录: %1$@，过滤疑似密钥: %2$@，忽略应用: %3$lld 个

source: Recording shortcut
zh_hans: 正在录制快捷键

source: Rectangle
zh_hans: 矩形

source: Rectangle (R)
zh_hans: 矩形（R）

source: Red
zh_hans: 红色

source: Redo
zh_hans: 重做

source: Redo (⇧⌘Z)
zh_hans: 重做（⇧⌘Z）

source: Refresh
zh_hans: 刷新

source: Regular
zh_hans: 中

source: Reinstall Cubby to restore it.
zh_hans: 重新安装 Cubby 即可恢复。

source: Remove
zh_hans: 移除

source: Remove %@
zh_hans: 移除 %@

source: Remove the user name, password, query or fragment from the URL.
zh_hans: 网址中不能包含用户名、密码、查询参数或片段。

source: Reset
zh_hans: 恢复默认

source: Restore default (%@)
zh_hans: 恢复默认（%@）

source: Restore default shortcut
zh_hans: 恢复默认快捷键

source: Resume
zh_hans: 恢复记录

source: Retry
zh_hans: 重试

source: Rich text
zh_hans: 含格式

source: Right-click
zh_hans: 右键

source: Same as macOS screenshots
zh_hans: 与系统截图相同

source: Save
zh_hans: 存储

source: Save (⌘S)
zh_hans: 存储（⌘S）

source: Save Key
zh_hans: 保存

source: Save after the translation finishes
zh_hans: 译文完成后才能存

source: Save as New Item (⌘S)
zh_hans: 存为新条目（⌘S）

source: Save screenshots to
zh_hans: 截图存储位置

source: Save the translation as a new item
zh_hans: 译文存为新条目

source: Saved as a new item
zh_hans: 已存为新条目

source: Saved to %@
zh_hans: 已存储到「%@」

source: Saved to Desktop (folder unavailable)
zh_hans: 文件夹不可用，已存储到桌面

source: Saved translations
zh_hans: 已保存的译文

source: Save…
zh_hans: 存储…

source: Screen Recording
zh_hans: 屏幕录制

source: Screen Recording is only used when you take a screenshot.
zh_hans: 屏幕录制仅在截图时使用。

source: Screen layout changed
zh_hans: 屏幕布局已变化，截图已取消

source: Screen recording: %@
zh_hans: 屏幕录制: %@

source: Screenshot
zh_hans: 截图

source: Screenshot shortcut
zh_hans: 截图快捷键

# Screenshot shortcut: %@, save location: %@
source: Screenshot shortcut: %1$@, save location: %2$@
zh_hans: 截图快捷键: %1$@，存储位置: %2$@

source: Screenshots
zh_hans: 截图

source: Screenshots are saved here without asking.
zh_hans: 截图会直接存储到这里，不再询问。

source: Search clipboard
zh_hans: 搜索剪贴板

source: Search text in images
zh_hans: 搜索图片中的文字

source: Search the Guide
zh_hans: 搜索使用说明

source: Secure input: %@
zh_hans: 安全键盘输入: %@

source: Select (or ⌃P ⌃N)
zh_hans: 选择（也可用 ⌃P ⌃N）

source: Select All
zh_hans: 全选

source: Select an item and press ⌘P to favorite it. Favorites are never removed automatically.
zh_hans: 选中条目后按 ⌘P 收藏，收藏不会被自动清理

source: Selection changed
zh_hans: 选区已变化

source: Sending after a moment…
zh_hans: 停留片刻后发送…

source: Sends only after you stay on an item for a moment
zh_hans: 在这条上停留片刻才发送

source: Sent to %@
zh_hans: 已发送到 %@

source: Sent, waiting for the first words…
zh_hans: 已发送，等待首个字…

source: Set Cubby to “Allow” in Privacy & Security › Paste from Other Apps so macOS stops asking every time you copy.
zh_hans: 在「隐私与安全性 › 从其他 App 粘贴」中将 Cubby 设为「允许」，macOS 就不会每次复制都询问

source: Set Cubby to “Allow” in Privacy & Security › Paste so macOS stops asking every time you copy.
zh_hans: 在「隐私与安全性 › 粘贴」中将 Cubby 设为「允许」，macOS 就不会每次复制都询问

source: Set from the language menu of the translation card
zh_hans: 在翻译卡的语言菜单中设置

source: Set one up in Settings › Translation. System Translation works on this Mac, free and offline.
zh_hans: 在「设置 › 翻译」里配置后即可使用。系统翻译在本机完成：免费、离线。

source: Set to “Ask”, so macOS will keep asking when you copy
zh_hans: 当前为「询问」，复制时会反复弹窗

source: Settings
zh_hans: 设置

source: Settings (⌘,)
zh_hans: 设置（⌘,）

source: Settings…
zh_hans: 设置…

source: Setup Guide…
zh_hans: 设置向导…

source: Shortcut & Panel
zh_hans: 快捷键与面板

# Shortcut: %@, panel position: %@
source: Shortcut: %1$@, panel position: %2$@
zh_hans: 快捷键: %1$@，面板位置: %2$@

source: Show Backup
zh_hans: 查看备份

source: Show File
zh_hans: 查看文件

source: Show Original (⇧⌘T)
zh_hans: 显示原文 (⇧⌘T)

source: Show Translation (⇧⌘T)
zh_hans: 显示译文 (⇧⌘T)

source: Show in Finder
zh_hans: 在访达中显示

source: Show translations on cards
zh_hans: 在卡片上显示译文

source: Signature: %@
zh_hans: 签名: %@

source: Small
zh_hans: 小

source: Some text wasn't translated
zh_hans: 部分内容未翻译

source: Something went wrong. Try again.
zh_hans: 出现问题，请重试。

source: Source language
zh_hans: 原文语言

source: Space
zh_hans: 空格

source: Space / ⌘Y
zh_hans: 空格 / ⌘Y

source: Space for clean window
zh_hans: 空格 纯净窗口

source: Starting with macOS 15.4, apps need permission to read the clipboard. Your history stays on this Mac.
zh_hans: 从 macOS 15.4 起，应用读取剪贴板需要授权。历史记录只保存在本机。

source: Startup & Updates
zh_hans: 启动与更新

source: Steps
zh_hans: 操作步骤

source: Still translating
zh_hans: 还在翻译中

source: Stop Ignoring
zh_hans: 不再忽略

source: Storage used
zh_hans: 占用空间

source: Stored in Keychain
zh_hans: 存储在钥匙串中

source: Swap
zh_hans: 对调

source: Swap (after the translation finishes)
zh_hans: 对调（译文完成后可用）

source: Swap (not available for images)
zh_hans: 对调（图片不支持）

source: Swap isn't available for text that looks like a secret with a cloud engine
zh_hans: 疑似包含密钥的内容用云端引擎时不能对调

source: Switch category
zh_hans: 切换分类

source: System Settings › General › Language & Region › Translation Languages
zh_hans: 系统设置 › 通用 › 语言与地区 › 翻译语言

source: System Translation
zh_hans: 系统翻译

source: System Translation runs on this Mac. A language needs a download the first time; after that it works offline.
zh_hans: 系统翻译在本机完成，首次使用某种语言需要下载语言包，下载后可离线翻译。

source: System languages: %@
zh_hans: 系统语言: %@

source: Tab ⇥ cycle · Space clean window
zh_hans: Tab ⇥ 切换层级 · 空格 纯净窗口

source: Tab ⇥ to cycle
zh_hans: Tab ⇥ 切换层级

source: Take Screenshot
zh_hans: 截图

source: Take and pin screenshots
zh_hans: 截图与贴图

source: Target app changed, copied instead
zh_hans: 目标应用已切换，已改为仅复制

source: Target language
zh_hans: 目标语言

source: Target language (saved for next time)
zh_hans: 目标语言（下次沿用）

source: Target language by app
zh_hans: 按应用记住的目标语言

source: Target language follows the system again
zh_hans: 已恢复：目标语言跟随系统

source: Test Connection
zh_hans: 测试连接

source: Text
zh_hans: 文本

source: Text (T)
zh_hans: 文字（T）

source: Text copied
zh_hans: 已复制文字

source: Text is recognized on this Mac and never uploaded
zh_hans: 文字在本机识别，不会上传

source: Text is too long to translate
zh_hans: 文字过长，无法翻译

source: The API key is invalid or not allowed
zh_hans: API Key 无效或无权限

source: The API key was rejected. Check that it's correct and has access.
zh_hans: API Key 被拒绝，请检查是否正确、是否有权限。

# The API key was saved for %@. Enter it again for %@.
source: The API key was saved for %1$@. Enter it again for %2$@.
zh_hans: API Key 是为 %1$@ 保存的，请为 %2$@ 重新填写。

source: The app's signature changed after an update, so the old Accessibility entry no longer applies.
zh_hans: 应用更新后签名变化，系统中的旧授权条目已不再生效

source: The first time you translate a language, macOS asks to download its language pack. After that, translation works offline. System Translation runs on this Mac, and text never leaves it.
zh_hans: 首次使用某种语言需要下载语言包，下载后可离线翻译。系统翻译在本机完成，文字不会离开这台 Mac。

source: The key may have expired or been mistyped. Nothing was translated or cached.
zh_hans: Key 可能已失效或填写有误。没有生成译文，也没有写入缓存。

source: The network is unavailable or the request timed out.
zh_hans: 网络不可用或请求超时

source: The original file was backed up. You can find it in Finder.
zh_hans: 原文件已备份，可在访达中查看

source: The response couldn't be read. Check the model name.
zh_hans: 返回内容无法识别，请检查模型名称。

source: The save dialog opens the last folder you used.
zh_hans: 存储对话框会打开上次使用的文件夹。

source: The server returned status %lld.
zh_hans: 服务器返回 %lld

source: The service
zh_hans: 翻译服务

source: The service is temporarily unavailable (%lld)
zh_hans: 服务暂时不可用（%lld）

source: The service returned an error (%lld).
zh_hans: 服务返回了错误（%lld）。

source: The service returned something unexpected. Nothing was cached.
zh_hans: 服务返回的内容无法识别，没有写入缓存。

source: The text is already in %@. Choose a target language
zh_hans: 原文已是%@，请选择目标语言

source: The update address is invalid.
zh_hans: 更新地址无效

source: The user guide couldn't be loaded.
zh_hans: 无法载入使用说明。

source: Thick
zh_hans: 粗

source: Thin
zh_hans: 细

source: This Mac
zh_hans: 本机

source: This isn't a valid URL.
zh_hans: 不是有效的网址。

source: This language pair isn't supported
zh_hans: 不支持该语言组合

source: To avoid data loss, history is read-only for now and new copies won't be saved. Please update to the latest version.
zh_hans: 为避免数据丢失，本次运行只读，新的复制不会保存。请升级到最新版本

source: Too large for history
zh_hans: 内容过大，未存入历史

source: Too many requests or no quota left
zh_hans: 请求过于频繁或额度不足

source: Too many requests, or the account is out of credit.
zh_hans: 请求过于频繁，或账户额度不足。

source: Translate
zh_hans: 翻译

source: Translate (press again to close)
zh_hans: 翻译（再按一次关闭）

source: Translate (⇧⌘T)
zh_hans: 翻译 (⇧⌘T)

source: Translate Again
zh_hans: 重新翻译

source: Translate Anyway
zh_hans: 仍然翻译

source: Translate and Paste
zh_hans: 翻译后粘贴

source: Translate into
zh_hans: 翻译为

source: Translate text when you copy it
zh_hans: 复制外文时自动翻译

source: Translate, then paste
zh_hans: 翻译后粘贴

source: Translated
zh_hans: 译文

source: Translated Text
zh_hans: 译文

source: Translated on this Mac; nothing leaves it
zh_hans: 本机翻译，内容未离开此 Mac

source: Translated with %@ and pasted
zh_hans: 已用%@翻译并粘贴

source: Translated with %@ and pasted as plain text
zh_hans: 已用%@翻译并粘贴（纯文本）

source: Translated: %@ (cached)
zh_hans: 已翻译：%@（已缓存）

# Translating %lld/%lld
source: Translating %1$lld/%2$lld
zh_hans: 正在翻译 %1$lld/%2$lld

# Translating %lld/%lld · esc to cancel
source: Translating %1$lld/%2$lld · esc to cancel
zh_hans: 翻译中 %1$lld/%2$lld · esc 取消

# Translating with %@ would send the whole text to %@. Nothing was sent.
source: Translating with %1$@ would send the whole text to %2$@. Nothing was sent.
zh_hans: 用 %1$@ 翻译会把全文发送到 %2$@，所以这次没有发送。

source: Translating…
zh_hans: 正在翻译…

source: Translating… %lld done
zh_hans: 正在翻译… 已完成 %lld 块

source: Translating… · esc to cancel
zh_hans: 翻译中… · esc 取消

source: Translation
zh_hans: 翻译

source: Translation Engine
zh_hans: 翻译引擎

source: Translation Settings…
zh_hans: 翻译设置…

source: Translation canceled
zh_hans: 已取消翻译

source: Translation cancelled
zh_hans: 已取消翻译

source: Translation cancelled · Press Esc again to close
zh_hans: 已取消翻译 · 再按一次 Esc 放弃截图

source: Translation closed
zh_hans: 已关闭翻译

source: Translation copied (%@)
zh_hans: 译文已复制（%@）

source: Translation copied as plain text (%@)
zh_hans: 译文已复制为纯文本（%@）

source: Translation engine
zh_hans: 翻译引擎

source: Translation isn't set up
zh_hans: 大模型尚未配置

source: Translation needs macOS 26 or later
zh_hans: 翻译需要 macOS 26 或更高版本

source: Translation preview
zh_hans: 译文预览

source: Translation timed out · ⌘T opens the card
zh_hans: 翻译超时 · ⌘T 打开翻译卡

source: Translation works on text, rich text and text in images. Code, links, colors and files stay as they are.
zh_hans: 翻译只处理文本、富文本和图片里的文字；代码、链接、颜色和文件保持原样。

source: Translation · %@
zh_hans: 译文 · %@

source: Translations of translated items are searched too. Press esc to clear the search.
zh_hans: 已翻译条目的译文也会被搜索。按 esc 清除搜索。

source: Translations saved with your history items will be deleted. Your history isn't affected.
zh_hans: 历史条目上保存的译文将被删除，历史本身不受影响。

source: Try Again
zh_hans: 重试

source: Try a different search, or press esc to clear it.
zh_hans: 换个关键词试试，按 esc 清空搜索

source: Try again in a moment.
zh_hans: 请稍后重试。

source: Undo
zh_hans: 撤销

source: Undo (⌘Z)
zh_hans: 撤销（⌘Z）

source: Undo delete
zh_hans: 撤销删除

source: Unfavorite
zh_hans: 取消收藏

source: United States
zh_hans: 美国

source: Unknown
zh_hans: 未知

source: Unknown source
zh_hans: 未知来源

source: Unreadable, read-only
zh_hans: 无法读取，只读

source: Unsigned
zh_hans: 未签名

source: Up / down 5 items (or Page Up, Page Down)
zh_hans: 向上 / 向下 5 条（或 Page Up、Page Down）

source: Up Arrow
zh_hans: 上箭头

source: Use https://. Plain http:// is only allowed for localhost.
zh_hans: 请使用 https://（仅本机地址可以用 http://）。

source: User Guide
zh_hans: 使用说明

source: User Guide…
zh_hans: 使用说明…

source: Version %@
zh_hans: 版本 %@

# Version %@ (%@)
source: Version %1$@ (%2$@)
zh_hans: 版本 %1$@（%2$@）

source: Version %@ Available…
zh_hans: 新版本 %@ 可用…

source: Version %@ is available
zh_hans: 发现新版本 %@

source: View (← / → to switch)
zh_hans: 显示方式（← / → 切换）

source: Wait a moment, then try again.
zh_hans: 请稍等片刻再重试。

source: Welcome to Cubby
zh_hans: 欢迎使用 Cubby

source: When the limit is reached, the oldest items are removed. Favorites don't count toward the limit.
zh_hans: 超出后自动删除最早的条目，收藏的条目不计入上限。

source: When translating, text recognized in the selection is sent to %@. Images are never uploaded. Text under mosaic and text that looks like a secret is never sent.
zh_hans: 翻译时，选区中识别出的文字会发送到 %@。图片不会上传。被马赛克遮住的文字、疑似密钥的文字不会发送。

source: When translating, text recognized in the selection is sent to Ollama on this Mac (%@) and never leaves it. Images are never uploaded.
zh_hans: 翻译时，选区中识别出的文字会发送到本机的 Ollama（%@），不会离开这台 Mac。图片不会上传。

source: When you choose an item
zh_hans: 选中条目后

source: White
zh_hans: 白色

source: Will be sent to %@
zh_hans: 将发送到 %@

source: Wipe position: original on the left, translation on the right
zh_hans: 卷帘位置：左侧原文，右侧译文

source: Wipe: drag the divider to compare
zh_hans: 卷帘对比：拖动分隔线

source: With Accessibility access, choosing an item pastes it into the current app. Otherwise it's only copied to the clipboard.
zh_hans: 授予辅助功能权限后，选中条目会直接粘贴到当前应用；否则只复制到剪贴板。

source: Yellow
zh_hans: 黄色

source: Yesterday %@
zh_hans: 昨天 %@

source: You can change this later in Privacy & Security › Paste from Other Apps.
zh_hans: 之后可在「隐私与安全性 › 从其他 App 粘贴」中修改

source: You can change this later in Privacy & Security › Paste.
zh_hans: 之后可在「隐私与安全性 › 粘贴」中修改

source: You're running version %@.
zh_hans: 当前版本 %@。

source: You're running version %@. If you installed Cubby with Homebrew, run: brew upgrade --cask cubby
zh_hans: 当前版本 %@。通过 Homebrew 安装的用户可运行：brew upgrade --cask cubby

source: You're up to date (%@)
zh_hans: 已是最新版本（%@）

source: Zhipu GLM
zh_hans: 智谱 GLM

# card.copyButton
source: Copy
zh_hans: 复制译文

# card.mode.compare
source: Compare
zh_hans: 对照

# card.pasteButton
source: Paste
zh_hans: 粘贴译文

# card.pasteWhenDoneButton
source: Paste When Done
zh_hans: 完成后粘贴

# card.recognizingText
source: Recognizing text…
zh_hans: 正在识别文字…

# card.saveButton
source: Save
zh_hans: 存为新条目

# card.translatedChip
source: Tr
zh_hans: 译

# footer.closeTranslation
source: Close
zh_hans: 关闭

# footer.copyPlainText
source: Copy plain text
zh_hans: 复制纯文本

# footer.copyTranslation
source: Copy
zh_hans: 复制译文

# footer.copyWithFormatting
source: Copy with format
zh_hans: 保留格式复制

# footer.holdAfter
source: preview
zh_hans: 预览译文

# footer.holdBefore
source: Hold
zh_hans: 按住

# footer.pastePlainText
source: Plain text
zh_hans: 纯文本粘贴

# footer.pasteWithFormatting
source: Keep format
zh_hans: 保留格式粘贴

# footer.saveTranslation
source: Save
zh_hans: 存为新条目

# footer.translateAndPaste
source: Translate
zh_hans: 翻译后粘贴

# footer.translationPlainText
source: Plain text
zh_hans: 纯文本

source: macOS may ask you to quit and reopen Cubby after granting access.
zh_hans: 授权后，macOS 可能会要求退出并重新打开 Cubby。

# menu.edit.copy
source: Copy
zh_hans: 拷贝

source: pastes when done…
zh_hans: 完成后粘贴…

# pin.copy
source: Copy
zh_hans: 拷贝

source: release ⌥ to restore
zh_hans: 松开 ⌥ 恢复

# screenshot.tool.text
source: Text
zh_hans: 文字

source: to go back
zh_hans: 回到译文

source: to see the original
zh_hans: 看原文

source: ↩ pastes this translation
zh_hans: ↩ 粘贴这段译文
